cask "aldente"
cask "alfred"
cask "alt-tab"
cask "anydesk"
cask "anytype"
cask "appcleaner"
cask "arc"
cask "background-music"
cask "beekeeper-studio"
cask "bitrix24"
cask "blackhole-2ch"
cask "bruno"
cask "buttercup"
cask "calibre"
cask "chatgpt"
cask "cheatsheet"
cask "chromedriver"
cask "clickhouse"
cask "clop"
cask "contexts"
cask "cursor"
cask "dash"
cask "dbeaver-community"
cask "deepl"
cask "discord"
cask "figma"
cask "google-chrome"
cask "iina"
cask "imazing"
cask "infra"
cask "iterm2"
cask "itermai"
cask "kap"
cask "keyboardcleantool"
cask "latest"
cask "lens"
cask "logseq"
cask "lookaway"
cask "loom"
cask "mimestream"
cask "miro"
cask "monitorcontrol"
cask "mumble"
cask "notion"
cask "notion-calendar"
cask "numi"
cask "obs"
cask "obsidian"
cask "openconnect-gui"
cask "openlens"
cask "orbstack"
cask "outline-manager"
cask "oversight"
cask "pearcleaner"
cask "postman"
cask "rectangle"
cask "scroll-reverser"
cask "session-manager-plugin"
cask "shadowsocksx-ng"
cask "shottr"
cask "skype"
cask "spotify"
cask "stand"
cask "steam"
cask "sublime-text"
cask "superwhisper"
cask "synology-drive"
cask "teamspeak-client"
cask "temurin"
cask "temurin@17"
cask "termius"
cask "topnotch"
cask "transmission"
cask "vagrant"
cask "vagrant-vmware-utility"
cask "visual-studio-code"
cask "vmware-fusion"
cask "warp"
cask "wave"
cask "wireshark"
cask "xmind"
cask "yandex"
cask "yandex-disk"
cask "yandex-music-unofficial"
cask "zappy"
cask "zoom"
