tap "caskroom/versions"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
# Search tool like grep, but optimized for programmers
brew "ack"
# Anycable Go WebSocket Server
brew "anycable-go"
# SSL/TLS cryptography library
brew "openssl"
# Library for command-line editing
brew "readline"
# Interpreted, interactive, object-oriented programming language
brew "python"
# Official Amazon AWS command-line interface
brew "awscli"
# Secure and free password manager for all of your devices
brew "bitwarden-cli"
# Portable Foreign Function Interface library
brew "libffi"
# Cross-platform make
brew "cmake"
# Dependency Manager for PHP
brew "composer"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Reimplementation of ctags(1)
brew "ctags"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Command-line fuzzy finder written in Go
brew "fzf"
# Command-line utility for uploading Gists
brew "gist"
# Distributed revision control system
brew "git"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Add GitHub support to git on the command-line
brew "hub"
# Tools and libraries to manipulate images in many formats
brew "imagemagick@6", link: true
# Kubernetes command-line interface
brew "kubernetes-cli"
# The Kubernetes package manager
brew "kubernetes-helm"
# YAML Parser
brew "libyaml"
# Mac App Store command-line interface
brew "mas"
# Unified display of technical and tag data for audio/video
brew "media-info"
# High performance, distributed memory object caching system
brew "memcached"
# Terminal-based visual file manager
brew "midnight-commander"
# 'traceroute' and 'ping' in a single tool
brew "mtr"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Port scanning utility for large networks
brew "nmap"
# Manage multiple Node.js versions
brew "nvm"
# Terminal multiplexer
brew "tmux"
# Process manager for Procfile-based applications and tmux
brew "overmind"
# 7-Zip (high compression file archiver) implementation
brew "p7zip"
# Shell command parallelization utility
brew "parallel"
# PDF to HTML converter
brew "pdf2htmlex"
# Manage compile and link flags for libraries
brew "pkg-config"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# Object-relational database system
brew "postgresql", restart_service: true
# Show ps output as a tree
brew "pstree"
# Password generator
brew "pwgen"
# Interpreted, interactive, object-oriented programming language
brew "python@2"
# Install various Ruby versions and implementations
brew "ruby-build"
# Ruby version manager
brew "rbenv"
# Reattach process (e.g., tmux) to background
brew "reattach-to-user-namespace"
# Persistent key-value database, with built-in net interface
brew "redis", restart_service: true
# Add a public key to a remote machine's authorized_keys file
brew "ssh-copy-id"
# Command-line interface for Telegram
brew "telegram-cli"
# User interface to the TELNET protocol (built from macOS Sierra sources)
brew "telnet"
# Internet file retriever
brew "wget"
# JavaScript package manager
brew "yarn"
# Download YouTube videos from the command-line
brew "youtube-dl"
cask "anydesk"
cask "cheatsheet"
cask "chromedriver"
cask "dash"
cask "docker"
cask "flash-npapi"
cask "genymotion"
cask "google-chrome"
cask "google-cloud-sdk"
cask "iina"
cask "imageoptim"
cask "iterm2"
cask "java8"
cask "kitematic"
cask "kubernetic"
cask "minikube"
cask "mysql-shell"
cask "ngrok"
cask "nightowl"
cask "psequel"
cask "signal"
cask "sketchup"
cask "skype"
cask "softorino-youtube-converter"
cask "sourcetree"
cask "spectacle"
cask "steam"
cask "sublime-text"
cask "teamviewer"
cask "tunnelblick"
cask "vagrant"
cask "virtualbox"
cask "visual-studio-code"
cask "wireshark"
cask "wkhtmltopdf"
cask "yandex-disk"
cask "zoomus"
mas "Amphetamine", id: 937984704
mas "Aware", id: 1082170746
mas "Be Focused Pro", id: 961632517
mas "Bitcoin Bar", id: 1307938864
mas "BreakTime", id: 427475982
mas "Cloud Mail.Ru", id: 893068358
mas "Divvy", id: 413857545
mas "Elmedia Player", id: 937759555
mas "Encrypto", id: 935235287
mas "Evernote", id: 406056744
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Microsoft Remote Desktop", id: 1295203466
mas "Microsoft Word", id: 462054704
mas "MindNode Lite", id: 402397683
mas "Monity", id: 915542151
mas "Monosnap", id: 540348655
mas "Next Meeting", id: 1017470484
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Pocket", id: 568494494
mas "Radio", id: 991729082
mas "Shazam", id: 897118787
mas "SiteSucker", id: 442168834
mas "Slack", id: 803453959
mas "Spark", id: 1176895641
mas "Telegram", id: 747648890
mas "Telephone", id: 406825478
mas "The Unarchiver", id: 425424353
mas "Trello", id: 1278508951
mas "Xcode", id: 497799835
