tap 'caskroom/cask'
tap 'caskroom/versions'

brew 'postgresql'
brew 'redis'
brew 'p7zip'
brew 'poppler'
brew 'libxml2'
brew 'v8@3.15'
brew 'imagemagick@6', link: true
brew 'python3'
brew 'awscli'
brew 'ffmpeg', args: ['with-freetype']
brew 'gist'
brew 'git'
brew 'gnuplot'
brew 'go'
brew 'mas'
brew 'media-info'
brew 'parallel'
brew 'postgresql'
brew 'pstree'
brew 'ruby-build'
brew 'rbenv'
brew 'telegram-cli'
brew 'tmux'
brew 'wget'
brew 'yarn'
brew 'youtube-dl'
brew 'coreutils'
brew 'git'
brew 'curl'
brew 'wget'
brew 'tmux'
brew 'mc'
brew 'ssh-copy-id'
brew 'ctags'
brew 'rbenv'
brew 'ack'
brew 'node'
brew 'pwgen'
brew 'pdf2htmlex'
brew 'youtube-dl'
brew 'icu4c'
brew 'reattach-to-user-namespace'
brew 'sqlite'
brew 'nmap'
brew 'yarn'
brew 'erlang'
brew 'elixir'
brew 'neovim'
brew 'kubernetes-cli'
brew 'kubernetes-helm'
brew 'hiredis'
brew 'p7zip'
brew 'poppler'
brew 'libxml2'
brew 'ffmpeg'
brew 'telnet'
brew 'jmeter'
brew 'imagemagick@6'
brew 'v8@3.15'
brew 'mas'
brew 'postgresql'
brew 'overmind'
brew 'bitwarden-cli'
brew 'fzf'
brew 'mtr'

cask 'dash'
cask 'discord'
cask 'docker'
cask 'firefox'
cask 'google-chrome'
cask 'ngrok'
cask 'safari-technology-preview'
cask 'signal'
cask 'skype'
cask 'softorino-youtube-converter'
cask 'spectacle'
cask 'steam'
cask 'sublime-text'
cask 'teamviewer'
cask 'tunnelblick'
cask 'visual-studio-code'
cask 'vlc'
cask 'whatsapp'
cask 'zoomus'
cask 'wkhtmltopdf'
cask 'nightowl'
cask 'tunnelblick'
cask 'wkhtmltopdf'
cask 'virtualbox'
cask 'docker'
cask 'kitematic'
cask 'gpg-suite'
cask 'google-cloud-sdk'
cask 'minikube'
cask 'flash-npapi'
cask 'mysql-shell'
cask 'wireshark'
cask 'imageoptim'
cask 'yandex-disk'
cask 'chromedriver'
cask 'google-chrome'
cask 'sublime-text'
cask 'sketchup'
cask 'zoomus'
cask 'iterm2'
cask 'java8'
cask 'skype'
cask 'visual-studio-code'
cask 'psequel'
cask 'sourcetree'
cask 'vagrant'
cask 'signal'
cask 'kubernetic'

mas 'Telegram', id: 747648890
mas 'Slack', id: 803453959
mas 'Spark', id: 1176895641
mas 'Xcode', id: 497799835
mas 'Keynote', id: 409183694
mas 'Pages', id: 409201541
mas 'Numbers', id: 409203825
mas 'iMovie', id: 408981434
mas 'GarageBand', id: 682658836
mas 'Encrypto', id: 935235287
