tap "caskroom/versions"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
# Search tool like grep, but optimized for programmers
brew "ack"
# Anycable Go WebSocket Server
brew "anycable-go"
# Cryptography and SSL/TLS Toolkit
brew "openssl@1.1"
# Library for command-line editing
brew "readline"
# Official Amazon AWS command-line interface
brew "awscli"
# Portable Foreign Function Interface library
brew "libffi"
# Cross-platform make
brew "cmake"
# Dependency Manager for PHP
brew "composer"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Reimplementation of ctags(1)
brew "ctags"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Asynchronous event library
brew "libevent"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Command-line fuzzy finder written in Go
brew "fzf"
# Command-line utility for uploading Gists
brew "gist"
# Distributed revision control system
brew "git"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# The Kubernetes package manager
brew "helm"
# Add GitHub support to git on the command-line
brew "hub"
# Tools and libraries to manipulate images in many formats
brew "imagemagick@6", link: true
# Kubernetes command-line interface
brew "kubernetes-cli"
# YAML Parser
brew "libyaml"
# Mac App Store command-line interface
brew "mas"
# Unified display of technical and tag data for audio/video
brew "media-info"
# High performance, distributed memory object caching system
brew "memcached"
# Interpreted, interactive, object-oriented programming language
brew "python"
# Terminal-based visual file manager
brew "midnight-commander"
# Run a Kubernetes cluster locally
brew "minikube", link: false
# 'traceroute' and 'ping' in a single tool
brew "mtr"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# HTTP(S) server and reverse proxy, and IMAP/POP3 proxy server
brew "nginx"
# Port scanning utility for large networks
brew "nmap"
# Platform built on V8 to build network applications
brew "node@10"
# Process manager for Procfile-based applications and tmux
brew "overmind"
# 7-Zip (high compression file archiver) implementation
brew "p7zip"
# Shell command parallelization utility
brew "parallel"
# PDF to HTML converter
brew "pdf2htmlex"
# Manage compile and link flags for libraries
brew "pkg-config"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# Object-relational database system
brew "postgresql@11", link: true
# Object-relational database system
brew "postgresql", link: false
# Show ps output as a tree
brew "pstree"
# Password generator
brew "pwgen"
# Interpreted, interactive, object-oriented programming language
brew "python@2"
# Install various Ruby versions and implementations
brew "ruby-build"
# Ruby version manager
brew "rbenv"
# Reattach process (e.g., tmux) to background
brew "reattach-to-user-namespace"
# Persistent key-value database, with built-in net interface
brew "redis"
# Add a public key to a remote machine's authorized_keys file
brew "ssh-copy-id", link: true
# Command-line interface for Telegram
brew "telegram-cli"
# User interface to the TELNET protocol
brew "telnet"
# Manage complex tmux sessions easily
brew "tmuxinator"
# Google's open source JavaScript engine
brew "v8@3.15"
# Internet file retriever
brew "wget"
# JavaScript package manager
brew "yarn"
# Download YouTube videos from the command-line
brew "youtube-dl"
cask "alfred"
cask "anydesk"
cask "appcleaner"
cask "brisync"
cask "cheatsheet"
cask "chromedriver"
cask "dash"
cask "discord"
cask "docker"
cask "figma"
cask "flash-npapi"
cask "google-chrome"
cask "google-cloud-sdk"
cask "iina"
cask "imageoptim"
cask "iterm2"
cask "java8"
cask "kitematic"
cask "lunar"
cask "minikube"
cask "mysql-shell"
cask "ngrok"
cask "nightowl"
cask "notion"
cask "numi"
cask "pixelsnap"
cask "psequel"
cask "rar"
cask "recordit"
cask "sensei"
cask "signal"
cask "sketchup"
cask "skype"
cask "sourcetree"
cask "spectacle"
cask "sublime-text"
cask "teamviewer"
cask "transmission-remote-gui"
cask "tunnelblick"
cask "vagrant"
cask "virtualbox"
cask "visual-studio-code"
cask "vlc"
cask "wireshark"
cask "wkhtmltopdf"
cask "yandex-disk"
cask "zoomus"
mas "Amphetamine", id: 937984704
mas "Backtrack", id: 1477089520
mas "Be Focused Pro", id: 961632517
mas "BreakTime", id: 427475982
mas "Bubble Translate 3", id: 1439344351
mas "Cloud Mail.Ru", id: 893068358
mas "Divvy", id: 413857545
mas "Elmedia Player", id: 937759555
mas "Encrypto", id: 935235287
mas "Evernote", id: 406056744
mas "Grammarly for Safari", id: 1462114288
mas "Jira", id: 1475897096
mas "JumpIn", id: 1506451016
mas "Keynote", id: 409183694
mas "Meeter", id: 1510445899
mas "Microsoft Remote Desktop", id: 1295203466
mas "MindNode Lite", id: 402397683
mas "Monity", id: 915542151
mas "Monosnap", id: 540348655
mas "Next Meeting", id: 1017470484
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Pocket", id: 568494494
mas "Radio", id: 991729082
mas "Shazam", id: 897118787
mas "SiteSucker", id: 442168834
mas "Slack", id: 803453959
mas "Spark", id: 1176895641
mas "Telegram", id: 747648890
mas "Telephone", id: 406825478
mas "The Unarchiver", id: 425424353
mas "Trello", id: 1278508951
mas "Twitter", id: 409789998
